Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.40/edc/ATSAMR30E18A.PIC
      <edc:SFRDef edc:access="-nnnnnnn" edc:addr="0x41000109" edc:cname="EPINTENSET0" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:desc="Error Flow 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:desc="Error Flow 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:desc="Received Setup Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:desc="Stall 0 In/out Interrupt enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:desc="Stall 1 In/out Interrupt enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnn" edc:addr="0x41000189" edc:cname="EPINTENSET4" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:desc="Error Flow 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:desc="Error Flow 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:desc="Received Setup Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:desc="Stall 0 In/out Interrupt enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:desc="Stall 1 In/out Interrupt enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4100000A" edc:cname="DADD" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DADD" edc:desc="Device Address" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="Device Address Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rr--rr--" edc:addr="0x4100000C" edc:cname="STATUS" edc:impl="0xCC" edc:mclr="01000000" edc:nzwidth="0x8" edc:por="01000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="Speed Status" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FS" edc:desc="Full-speed mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HS" edc:desc="High-speed mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LS" edc:desc="Low-speed mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINESTATE" edc:desc="USB Line State Status" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="SE0/RESET" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="FS-J or LS-K State" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="FS-K or LS-J State" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-rrrrrrrrrrrrrr" edc:addr="0x41000010" edc:cname="FNUM" edc:impl="0xBFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:desc="Micro Frame Number" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:desc="Frame Number" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FNCERR" edc:desc="Frame Number CRC Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nnnnnnnnnn" edc:addr="0x41000014" edc:cname="INTENCLR" edc:impl="0x3FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:desc="Suspend Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSOF" edc:desc="Micro Start of Frame Interrupt Enable in High Speed Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:desc="Start Of Frame Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:desc="End of Reset Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Wake Up Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:desc="End Of Resume Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:desc="Upstream Resume Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:desc="Ram Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPMNYET" edc:desc="Link Power Management Not Yet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPMSUSP" edc:desc="Link Power Management Suspend Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
